""" 
Похожие массивы
Два массива называются похожими, если совпадают множества чисел, встречающихся в этих массивах.

Требуется написать программу, которая определит: похожи ли два заданных массива.

Входные данные
Входной файл INPUT.TXT содержит в первой строке два числа M и N 
- длины массивов (1 ≤ M, N ≤ 16000). 
Во второй строке записаны M чисел – элементы первого массива. 
В третьей строке записаны N чисел – элементы второго массива. 
Числа в строках разделены пробелами, 
элементы массивов - целые числа, не превышающие 32000 по абсолютной величине.
"""

m, n = map(int, input().split())

array1 = list(map(int, input().split()))
array2 = list(map(int, input().split()))
print(1 if set(array1) == set(array2) else 0)
